app/Controllers/Cart.php

    protected function getUserCartId()
    {
        $userId = session()->get('user_id'); // pastikan login
        $cart = $this->cartModel->where('user_id', $userId)->first();

        if (!$cart) {
            $cartId = $this->cartModel->insert(['user_id' => $userId], true);
---
SELECT *
FROM `cart`
WHERE `user_id` = '3'
 LIMIT 1
INSERT INTO `cart` (`user_id`, `created_at`, `updated_at`) VALUES ('3', '2025-11-30 15:08:04', '2025-11-30 15:08:04')

    public function index()
    {
        $cartId = $this->getUserCartId();

        $items = $this->cartItemModel
              ->select('cart_items.*, products.name, products.price, product_images.image_url as image')
              ->join('products', 'products.product_id = cart_items.product_id')
              ->join('product_images', 'product_images.product_id = products.product_id AND product_images.is_primary = 1', 'left')
              ->where('cart_id', $cartId)
              ->findAll();
---
SELECT `cart_items`.*, `products`.`name`, `products`.`price`, `product_images`.`image_url` as `image`
FROM `cart_items`
JOIN `products` ON `products`.`product_id` = `cart_items`.`product_id`
LEFT JOIN `product_images` ON `product_images`.`product_id` = `products`.`product_id` AND `product_images`.`is_primary` = 1
WHERE `cart_id` = '3'

    public function add($productId)
    {
        $product = $this->product->find($productId);
        if (!$product) return redirect()->back()->with('error', 'Product not found');

        $qty = (int) $this->request->getGet('qty');
        $qty = max(1, min($qty, $product['stock']));

        $cartId = $this->getUserCartId();

        $existing = $this->cartItemModel->where(['cart_id' => $cartId, 'product_id' => $productId])->first();
        // dd($existing);
        if ($existing) {
            $newQty = min($existing['quantity'] + $qty, $product['stock']);
            $this->cartItemModel->update($existing['cart_item_id'], ['quantity' => $newQty]);
        } else {
            $this->cartItemModel->insert([
                'cart_id' => $cartId,
                'product_id' => $productId,
                'quantity' => $qty,
                'unit_price' => $product['price']
            ]);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '4'
SELECT *
FROM `cart_items`
WHERE `cart_id` = '3'
AND `product_id` = '4'
 LIMIT 1
INSERT INTO `cart_items` (`cart_id`, `product_id`, `quantity`, `unit_price`, `created_at`, `updated_at`) VALUES ('3', '4', 1, '24999.00', '2025-11-30 15:11:10', '2025-11-30 15:11:10')