app/Controllers/login.php

    public function auth()
    {
        $session = session();
        $userModel = new UserModel();

        $full_name = $this->request->getPost('full_name');
        $password_hash = $this->request->getPost('password_hash');

        $user = $userModel->where('full_name', $full_name)
                          ->orWhere('email', $full_name)
                          ->first();
---
SELECT *
FROM `users`
WHERE `full_name` = 'najwachelsea168@gmail.com'
OR `email` = 'najwachelsea168@gmail.com'
 LIMIT 1