app/Controllers/Order.php

    public function myorder()
{
    $userId = session()->get('user_id');
    if (!$userId) return redirect()->to('/login');

    // Pagination: 5 orders per page
    $perPage = 5;

    $ordersQuery = $this->orderModel
        ->where('user_id', $userId)
        ->orderBy('order_date', 'DESC');

    $orders = $ordersQuery->paginate($perPage, 'orders');
    $pager = $ordersQuery->pager; // Pager object

    foreach ($orders as &$order) {
        $items = $this->orderItemModel
            ->select('order_items.*, products.name, products.price as unit_price, product_images.image_url as image')
            ->join('products', 'products.product_id = order_items.product_id')
            ->join('product_images', 'product_images.product_id = products.product_id AND product_images.is_primary = 1', 'left')
            ->where('order_id', $order['order_id'])
            ->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = '2'
ORDER BY `order_date` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `user_id` = '2'
SELECT `order_items`.*, `products`.`name`, `products`.`price` as `unit_price`, `product_images`.`image_url` as `image`
FROM `order_items`
JOIN `products` ON `products`.`product_id` = `order_items`.`product_id`
LEFT JOIN `product_images` ON `product_images`.`product_id` = `products`.`product_id` AND `product_images`.`is_primary` = 1
WHERE `order_id` = '1'

    public function submit()
    {
        $request = service('request');
        $paymentModel = new PaymentsModel();
        $ordersModel  = new OrderModel();

        $order_id = $request->getPost('order_id');
        $amount = (int) $this->request->getPost('amount');
        $file     = $request->getFile('payment_proof');

        if (!$order_id || !$amount) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid data'
            ]);
        }

        // Handle file upload
        $filename = null;
        if ($file && $file->isValid() && !$file->hasMoved()) {
            $filename = $file->getRandomName();
            $file->move(FCPATH . 'uploads/payments', $filename);
        }

        // Simpan payment
        $paymentModel->save([
            'order_id' => $order_id,
            'payment_proof' => $filename,
            'payment_date' => date('Y-m-d H:i:s'),
            'payment_method' => 'Transfer Bank',
            'amount' => $amount,
        ]);

        // Update status order menjadi paid
        $ordersModel->update($order_id, [
            'status' => 'verification'
        ]);
---
INSERT INTO `payments` (`order_id`, `payment_proof`, `payment_date`, `payment_method`, `amount`, `created_at`, `updated_at`) VALUES ('5', '1764511345_e08542bfb6e15bdd59ca.jpg', '2025-11-30 14:02:25', 'Transfer Bank', 54247, '2025-11-30 14:02:25', '2025-11-30 14:02:25')
UPDATE `orders` SET `status` = 'verification', `updated_at` = '2025-11-30 14:02:25'
WHERE `orders`.`order_id` IN ('5')