app/Controllers/Shop.php

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function index()
    {
        $productModel = new ProductModel();

        // Get query parameters
        $category = $this->request->getGet('category');
        $price = $this->request->getGet('price');
        $sort = $this->request->getGet('sort');
        $page = $this->request->getGet('page') ?? 1;

        $totalProducts = $productModel->countAll();

SELECT *
FROM `promotions`
WHERE `status` = 'active'
AND `start_date` <= '2025-11-26 03:24:43'
AND `end_date` >= '2025-11-26 03:24:43'
ORDER BY `start_date` DESC
 LIMIT 1
---
        $now = date('Y-m-d H:i:s');

        $promoModel = new PromotionModel();
        $activePromo = $promoModel
        ->where('status', 'active')
        ->where('start_date <=', $now)
        ->where('end_date >=', $now)
        ->orderBy('start_date', 'DESC')
        ->first();

SELECT `products`.*, `product_images`.`image_url`
FROM `products`
LEFT JOIN `product_images` ON `product_images`.`product_id` = `products`.`product_id` AND `product_images`.`is_primary` = 1
WHERE `slug` = 'steel-rebar-set'
 LIMIT 1
---
    public function detail($slug)
    {
        $productModel = new ProductModel();
        $specModel = new ProductSpecificationModel();
        $reviewModel = new ReviewModel();

        // Ambil produk berdasarkan slug
        $product = $productModel
            ->select('products.*, product_images.image_url')
            ->join('product_images', 'product_images.product_id = products.product_id AND product_images.is_primary = 1', 'left')
            ->where('slug', $slug)
            ->first();