app/Models/ProductSpecificationModel.php

SELECT *
FROM `product_specifications`
WHERE `product_id` = '2'
---
    public function getSpecs($productId)
    {
        return $this->where('product_id', $productId)->findAll();

SELECT *
FROM `product_specifications`
WHERE `product_id` = '1'
AND `specification_name` = 'weight'
 LIMIT 1
---
    public function getWeight($productId)
    {
        $row = $this->where('product_id', $productId)
                    ->where('specification_name', 'weight')
                    ->first();