app/Models/ProductModel.php

SELECT *
FROM `product_images`
WHERE `product_id` = '2'
ORDER BY `is_primary` DESC
---
    public function getImages($productId)
    {
        return $this->db->table('product_images')
            ->where('product_id', $productId)
            ->orderBy('is_primary', 'DESC')
            ->get()
            ->getResultArray();

SELECT `products`.*, `product_images`.`image_url`
FROM `products`
LEFT JOIN `product_images` ON `product_images`.`product_id` = `products`.`product_id` AND `product_images`.`is_primary` = 1
WHERE `products`.`category_id` = '2'
AND `products`.`product_id` != '9'
AND `products`.`status` = 'active'
 LIMIT 4
---
    public function getRelatedProducts($categoryId, $currentProductId)
    {
        return $this->select("
                products.*,
                product_images.image_url,
                (SELECT AVG(rating) FROM reviews WHERE reviews.product_id = products.product_id) AS avg_rating,
                (SELECT COUNT(*) FROM reviews WHERE reviews.product_id = products.product_id) AS review_count
            ")
            ->join(
                'product_images',
                'product_images.product_id = products.product_id
                AND product_images.is_primary = 1',
                'left'
            )
            ->where('products.category_id', $categoryId)
            ->where('products.product_id !=', $currentProductId)
            ->where('products.status', 'active')
            ->limit(4)
            ->findAll();