app/Models/ReviewModel.php

    public function getReviews($productId)
    {
        return $this->select('reviews.*, users.full_name')
                    ->join('users', 'users.user_id = reviews.user_id', 'left')
                    ->where('reviews.product_id', $productId)
                    ->orderBy('reviews.created_at', 'DESC')
                    ->findAll();
---
SELECT `reviews`.*, `users`.`full_name`
FROM `reviews`
LEFT JOIN `users` ON `users`.`user_id` = `reviews`.`user_id`
WHERE `reviews`.`product_id` = '2'
ORDER BY `reviews`.`created_at` DESC

    public function getAverageRating($productId)
    {
        return $this->where('product_id', $productId)
                    ->selectAvg('rating')
                    ->first();
---
SELECT AVG(`rating`) AS `rating`
FROM `reviews`
WHERE `product_id` = '2'
 LIMIT 1

    public function getReviewCount($productId)
    {
        return $this->where('product_id', $productId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reviews`
WHERE `product_id` = '2'